/*
   Localizable.strings
   Proxly

   Created for localization support.
*/

// MARK: - Defaults
"defaults.new_rule_name" = "New Rule";

// MARK: - Tab Navigation
"tab.rules" = "Rules";
"tab.settings" = "Settings";
"tab.about" = "About";

// MARK: - General UI
"window.title.settings" = "Proxly Settings";
"button.add_rule" = "Add Rule";
"button.save" = "Save";
"button.cancel" = "Cancel";
"button.delete" = "Delete";
"button.ok" = "OK";
"button.open_system_preferences" = "Open System Preferences";

// MARK: - Settings View
"settings.title" = "Settings";
"settings.section.general" = "General";
"settings.section.default_behavior" = "Default Behavior";
"settings.section.logging" = "Logging";

"settings.enable_rules.title" = "Enable rules";
"settings.enable_rules.subtitle.enabled" = "Rules are active";
"settings.enable_rules.subtitle.disabled" = "⚠️ All rules will be ignored!";

"settings.launch_at_login.title" = "Launch at login";
"settings.launch_at_login.subtitle" = "Automatically start Proxly when you log in to your Mac";

"settings.when_no_rule_matches" = "When no rule matches:";
"settings.default_behavior.show_selection" = "Show browser selection";
"settings.default_behavior.open_fallback" = "Open fallback browser";

"settings.fallback_browser.title" = "Fallback Browser";
"settings.fallback_browser.subtitle" = "Used when no rule matches and 'Open fallback browser' is selected";

"settings.notify_fallback.title" = "Show notification when fallback browser is used";
"settings.notify_fallback.subtitle" = "Get notified when a URL is opened with the fallback browser";

"settings.logging.enable" = "Enable logging";
"settings.logging.subtitle" = "When turned on, Proxly will log opened URLs and diagnostic messages. No data is being collected.";

"settings.tooltips.title" = "Show tooltips";
"settings.tooltips.subtitle" = "Display helpful hints when hovering over interface elements";
"settings.tooltips.enable_rules" = "Toggle this to enable or disable all browser routing rules. When disabled, all rules will be ignored and default behavior will be used.";
"settings.tooltips.launch_at_login" = "When enabled, Proxly will automatically start when you log in to your Mac, ensuring your rules are always active.";
"settings.tooltips.default_behavior" = "Choose what happens when no rule matches a URL: either show browser selection dialog or automatically open with fallback browser.";
"settings.tooltips.fallback_browser" = "Select which browser to use as the fallback when no rule matches and fallback option is selected.";
"settings.tooltips.notify_fallback" = "When enabled, you'll receive a notification whenever a URL is opened with the fallback browser.";
"settings.tooltips.enable_logging" = "Enable logging to help diagnose issues. Proxly will log opened URLs and diagnostic messages. No personal data is collected.";
"settings.tooltips.show_tooltips" = "Toggle this setting to show or hide helpful tooltips when hovering over interface elements.";

// MARK: - Notifications
"notification.permission.title" = "Notification Permission Required";
"notification.permission.message" = "Proxly needs permission to send notifications. Please enable notifications in System Preferences.";
"notification.denied.title" = "Notifications Denied";
"notification.denied.message" = "You have previously denied notification permissions. Please enable notifications in System Preferences if you want to receive alerts.";
"notification.fallback.title" = "Fallback Browser Used";
"notification.fallback.body" = "Opened URL in fallback browser: %@";

// MARK: - Rules View
"rules.title" = "Rules";
"rules.status.enabled" = "Enabled";
"rules.status.disabled" = "Disabled";
"rules.empty.title" = "No Rules Yet";
"rules.empty.subtitle" = "Create your first rule to start routing URLs intelligently";
"rules.empty.description" = "Rules allow you to automatically open different websites in specific browsers based on domains, focus modes, or time of day.";
"rules.select.title" = "Select a Rule";
"rules.select.subtitle" = "Choose a rule from the list to view and edit its details";
"rules.priority.title" = "Priority";

// MARK: - Rule Edit View
"rule.edit.title.new" = "Add Rule";
"rule.edit.title.edit" = "Edit Rule";
"rule.edit.name.placeholder" = "Enter rule name";
"rule.edit.name.empty" = "Rule name cannot be empty";
"rule.edit.name.valid" = "Rule name is valid";
"rule.edit.saved.title" = "Rule Saved";
"rule.edit.section.name" = "Name";
"rule.edit.section.type" = "Rule Type";
"rule.edit.section.condition" = "Condition";
"rule.edit.section.browser" = "Target Browser";
"rule.edit.section.priority" = "Priority";
"rule.edit.tooltip.rule_name" = "Enter the name for the rule.";
"rule.edit.tooltip.domain_condition_value" = "Enter domain to be matched for this rule. Simple wildcards and more advanced regex are supported.\nExamples include:\n mail.google.com         → Exact match (most specific)\n*.google.com            → Wildcard match\nregex:.*\.com$          → Regex match (least specific)";
"rule.edit.tooltip.focus_mode_condition_value" = "Enter the Focus name *exactly* as it's named in the OS and to which you have added Focus Filter. eg. 'Work'";
"rule.edit.tooltip.time_condition_value" = "Select applicable time ranges.";
"rule.edit.tooltip.domain_rule_type" = "Domain rule type: matches either exact or partially to domain name in the link to open desired browser.";
"rule.edit.tooltip.focus_mode_rule_type" = "Focus mode rule type: Matches on exact name of Focus mode. Requires adding Focus Filter to the desired Focus Mode.";
"rule.edit.tooltip.time_rule_type" = "Time-based rule type: Matches selected time range and days.";
"rule.edit.tooltip.priority" = "Priority decides on the priority of the rules within the same class/type. There may be multiple rules matching for the same link, but priority will decide which is more important.";


"rule.condition.placeholder" = "e.g., apple.com or Work";
"rule.validation.empty" = "Condition cannot be empty.";
"rule.validation.duplicate" = "A rule with this type and condition already exists.";
"rule.validation.valid" = "Condition is valid";

"rule.priority.title" = "Priority Level";
"rule.priority.subtitle" = "Higher priority rules are evaluated first within their class";

"rule.delete.title" = "Delete Rule";
"rule.delete.message" = "Are you sure you want to delete this rule? This action cannot be undone.";

// MARK: - Rule Types
"rule_type.domain" = "Domain";
"rule_type.focus_mode" = "Focus Mode";
"rule_type.time" = "Time";

// MARK: - Time-Based Rules
"time_rule.time.start" = "Start Time";
"time_rule.time.end" = "End Time";
"time_rule.time.section_title" = "Time Range";
"time_rule.time.overnight_warning" = "This rule will be active overnight (crosses midnight)";
"time_rule.time.active_preview" = "Active from %@ to %@";

"time_rule.days.section_title" = "Days of Week";
"time_rule.days.weekdays" = "Weekdays";
"time_rule.days.weekends" = "Weekends";
"time_rule.days.all_days" = "All Days";
"time_rule.days.clear" = "Clear";

"time_rule.days.sunday" = "Sunday";
"time_rule.days.monday" = "Monday";
"time_rule.days.tuesday" = "Tuesday";
"time_rule.days.wednesday" = "Wednesday";
"time_rule.days.thursday" = "Thursday";
"time_rule.days.friday" = "Friday";
"time_rule.days.saturday" = "Saturday";

"time_rule.days.sun" = "Sun";
"time_rule.days.mon" = "Mon";
"time_rule.days.tue" = "Tue";
"time_rule.days.wed" = "Wed";
"time_rule.days.thu" = "Thu";
"time_rule.days.fri" = "Fri";
"time_rule.days.sat" = "Sat";

"time_rule.days.active_on" = "Active on: %@";

"time_rule.preview.title" = "Rule Preview";
"time_rule.preview.summary" = "Active on %@ from %@ to %@";
"time_rule.preview.every_day" = "Every day";

"time_rule.validation.invalid_time_range" = "Start and end time cannot be the same";
"time_rule.validation.no_days_selected" = "Please select at least one day";
"time_rule.validation.duplicate_range" = "This time range already exists for the selected days";

// MARK: - Browser Selection
"browser_selection.title" = "Choose a Browser";
"browser_selection.subtitle" = "Select which browser should open this link";
"browser_selection.url_label" = "Opening:";
"browser_selection.remember" = "Remember this choice";
"browser_selection.action" = "Open";

// MARK: - About View
"about.title" = "About";
"about.app_subtitle" = "Smart Browser Chooser";
"about.version" = "Version";
"about.build" = "Build";

"about.section.what_is" = "What is Proxly?";
"about.description.main" = "Proxly is an intelligent browser chooser that automatically routes web links to the right browser based on customizable rules.";
"about.description.detail" = "Never again worry about opening work links in your personal browser or vice versa. Set up rules based on domains, focus modes, or time of day, and let Proxly handle the rest.";

"about.section.features" = "Key Features";
"about.feature.domain_rules.title" = "Domain-based Rules";
"about.feature.domain_rules.description" = "Route specific websites to designated browsers";
"about.feature.focus_mode.title" = "Focus Mode Integration";
"about.feature.focus_mode.description" = "Different browsers for work and personal time";
"about.feature.time_based.title" = "Time-based Routing";
"about.feature.time_based.description" = "Automatic browser selection based on time of day";
"about.feature.priority.title" = "Priority System";
"about.feature.priority.description" = "Fine-tune rule precedence with priority levels";
"about.feature.menu_bar.title" = "Menu Bar Integration";
"about.feature.menu_bar.description" = "Quick access to rules and settings from the menu bar";

"about.section.developer" = "Developer";
"about.developer.name" = "Paweł Mazurkiewicz";
"about.developer.role" = "macOS Developer";
"about.developer.description" = "Crafting beautiful, functional apps for Mac";

"about.section.links" = "Links & Support";
"about.link.website" = "Website";
"about.link.support" = "Support";
"about.link.support_description" = "Need support? Let me know!";
"about.link.feature_request" = "Request a feature";
"about.link.feature_request_description" = "Have an idea for a new feature? Share it!";
"about.link.rate" = "Rate Proxly on the App Store";
"about.link.rate_description" = "If you enjoy using Proxly, please consider leaving a rating on the App Store!";
"about.link.github" = "Source Code";

// MARK: - Menu Bar
"menu.toggle_rules" = "Toggle Rules";
"menu.open_settings" = "Open Settings...";
"menu.quit" = "Quit Proxly";

// MARK: - Errors
"error.app_not_found" = "Application with bundle ID '%@' not found.";
"error.open_failed" = "Failed to open URL: %@";

/* Rule List */
"rule_list_title" = "Rules";
"rule_list_subtitle" = "Manage your browser routing rules";
"rule_list_browser" = "Browser";
"rule_list_priority" = "Priority";

// MARK: - Focus Mode
"focus.app_filter.title" = "App Focus Filter";
"focus.app_filter.description" = "Configure app behavior for different Focus modes";
"focus.display_representation.title" = "Focus: %@";
"focus.display_representation.subtitle" = "Custom app behavior for this Focus";
"focus.unnamed" = "Unnamed";

"focus.status.not_determined" = "Not Determined";
"focus.status.restricted" = "Restricted";
"focus.status.denied" = "Denied";
"focus.status.authorized" = "Authorized";
"focus.status.unknown" = "Unknown";

"focus.info.status.active" = "Active";
"focus.info.status.inactive" = "Inactive";
"focus.info.authorization" = "Authorization";
"focus.info.name" = "Focus Name";
"focus.info.name.not_available" = "Not available (requires user setup)";

// MARK: - Focus Suggestions
"focus.suggestion.work" = "Work";
"focus.suggestion.personal" = "Personal";
"focus.suggestion.sleep" = "Sleep";
"focus.suggestion.do_not_disturb" = "Do Not Disturb";

// MARK: - Accessibility
"accessibility.section.label" = "Section";

// Rule Edit Accessibility
"accessibility.rule_edit.name.label" = "Rule name";
"accessibility.rule_edit.name.hint" = "Enter a descriptive name for this rule";

"accessibility.validation.name_empty" = "Rule name is empty";
"accessibility.validation.name_valid" = "Rule name is valid";
"accessibility.validation.condition_empty" = "Condition is empty";
"accessibility.validation.condition_duplicate" = "A rule with this condition already exists";
"accessibility.validation.condition_valid" = "Condition is valid";

"accessibility.rule_edit.rule_type.label" = "Rule type";
"accessibility.rule_edit.rule_type.hint" = "Select the type of rule to create";
"accessibility.rule_edit.rule_type.section_label" = "Rule type selection";
"accessibility.rule_edit.rule_type.domain.label" = "Domain-based rule";
"accessibility.rule_edit.rule_type.domain.hint" = "Create a rule that matches website domains";
"accessibility.rule_edit.rule_type.focus_mode.label" = "Focus mode rule";
"accessibility.rule_edit.rule_type.focus_mode.hint" = "Create a rule that activates during specific Focus modes";
"accessibility.rule_edit.rule_type.time.label" = "Time-based rule";
"accessibility.rule_edit.rule_type.time.hint" = "Create a rule that activates during specific times and days";

"accessibility.rule_edit.condition.label" = "Rule condition";
"accessibility.rule_edit.condition.hint" = "Enter the condition that will trigger this rule";
"accessibility.rule_edit.condition.section_label" = "Rule condition";

"accessibility.rule_edit.browser_selection.label" = "Select a browser";
"accessibility.rule_edit.browser_selection.hint" = "Choose the browser to open links that match this rule";
"accessibility.rule_edit.browser.section_label" = "Target browser selection";
"accessibility.rule_edit.browser.selected_hint" = "Tap to select a different browser";
"accessibility.rule_edit.browser.unselected_hint" = "Tap to select this browser";
"accessibility.rule_edit.browser.selected_label" = "%@ browser, currently selected";
"accessibility.rule_edit.browser.unselected_label" = "%@ browser, not selected";

"accessibility.rule_edit.browser_row.selected" = "Selected browser: %@";
"accessibility.rule_edit.browser_row.unselected" = "Unselected browser: %@";
"accessibility.rule_edit.browser_row.hint" = "Tap to change the browser for this rule";
"accessibility.rule_edit.browser_row.selected_label" = "Selected browser";
"accessibility.rule_edit.browser_row.unselected_label" = "Available browser";
"accessibility.rule_edit.browser_row.selected_hint" = "This browser is currently selected for this rule";
"accessibility.rule_edit.browser_row.unselected_hint" = "Tap to select this browser for this rule";

"accessibility.rule_edit.priority.label" = "Rule priority";
"accessibility.rule_edit.priority.hint" = "Adjust the priority level for this rule. Higher priority rules take precedence";
"accessibility.rule_edit.priority.section_label" = "Priority setting";
"accessibility.rule_edit.priority.value_label" = "Priority level %d";

"accessibility.rule_edit.button.save.hint" = "Save the current rule configuration";
"accessibility.rule_edit.button.save.hint_disabled" = "Complete all required fields to save the rule";
"accessibility.rule_edit.button.cancel.hint" = "Cancel editing and discard changes";
"accessibility.rule_edit.cancel_button.hint" = "Cancel editing and discard changes";
"accessibility.rule_edit.button.delete.hint" = "Delete this rule permanently";
"accessibility.rule_edit.button.delete.label" = "Delete rule";

"accessibility.rule_edit.validation.error_label" = "Validation error";
"accessibility.rule_edit.validation.success_label" = "Validation successful";

"accessibility.rule_edit.save_success" = "Rule saved successfully";
"accessibility.rule_edit.success.label" = "Rule saved successfully";
"accessibility.rule_edit.success.hint" = "The rule has been saved and is now active";

// General Accessibility
"accessibility.general.section_header" = "Section header";
"accessibility.general.validation_message" = "Validation message";
"accessibility.general.success_indicator" = "Success indicator";

// Browser Selection Accessibility
"accessibility.browser_selection.row_label" = "Browser option";
"accessibility.browser_selection.selected_state" = "Selected";
"accessibility.browser_selection.unselected_state" = "Not selected";

// Time-Based Rule Accessibility
"accessibility.time_based_rule.time_range.section_label" = "Time range settings";
"accessibility.time_based_rule.time_range.start_time_label" = "Start time";
"accessibility.time_based_rule.time_range.end_time_label" = "End time";
"accessibility.time_based_rule.time_range.start_time_hint" = "Set the time when this rule becomes active";
"accessibility.time_based_rule.time_range.end_time_hint" = "Set the time when this rule becomes inactive";

"accessibility.time_based_rule.day_selection.section_label" = "Day selection";
"accessibility.time_based_rule.day_selection.day_selected_hint" = "This day is included in the rule";
"accessibility.time_based_rule.day_selection.day_unselected_hint" = "Tap to include this day in the rule";

"accessibility.time_based_rule.preview.label" = "Rule preview";
"accessibility.time_based_rule.preview.hint" = "Summary of when this rule will be active";

"accessibility.time_based_rule.time_range.overnight_warning_label" = "Overnight range warning: this rule will be active across midnight";
"accessibility.time_based_rule.time_range.preview_label" = "Active time range preview";
"accessibility.time_based_rule.day_selection.day_button_label" = "Day: %@, Status: %@";
"accessibility.time_based_rule.day_selection.clear_button_label" = "Clear selection";
"accessibility.time_based_rule.day_selection.clear_button_hint" = "Tap to deselect all days of the week";
"accessibility.time_based_rule.day_selection.preset_button_label" = "Preset: %@, Status: %@";
"accessibility.time_based_rule.day_selection.preset_button_hint" = "Tap to apply a day preset like weekdays or weekends";
"accessibility.time_based_rule.day_selection.selected_days_preview_label" = "Preview of selected days";

// MARK: - Accessibility Strings for Settings
"accessibility.settings.toolbar.title.label" = "Proxly Settings";
"accessibility.settings.toolbar.title.hint" = "Main settings page for Proxly app configuration";

// Settings - General Section
"accessibility.settings.general.section_label" = "General Settings Section";
"accessibility.settings.general.enable_rules.label" = "Enable rules toggle";
"accessibility.settings.general.enable_rules.hint" = "When enabled, all rules will be active. When disabled, all rules will be ignored";
"accessibility.settings.general.enable_rules.value.enabled" = "Rules are enabled";
"accessibility.settings.general.enable_rules.value.disabled" = "Rules are disabled";
"accessibility.settings.general.launch_at_login.label" = "Launch at login toggle";
"accessibility.settings.general.launch_at_login.hint" = "When enabled, Proxly will automatically start when you log in to your Mac";
"accessibility.settings.general.launch_at_login.value.enabled" = "Launch at login is enabled";
"accessibility.settings.general.launch_at_login.value.disabled" = "Launch at login is disabled";

// Settings - Default Behavior Section
"accessibility.settings.default_behavior.section_label" = "Default Behavior Settings Section";
"accessibility.settings.default_behavior.picker.label" = "Default behavior picker";
"accessibility.settings.default_behavior.picker.hint" = "Choose what happens when no rule matches a URL. Either show browser selection or open fallback browser";
"accessibility.settings.default_behavior.picker.value" = "Currently set to %@";
"accessibility.settings.fallback_browser.picker.label" = "Fallback browser picker";
"accessibility.settings.fallback_browser.picker.hint" = "Select which browser to use as fallback when no rule matches and fallback option is selected";
"accessibility.settings.fallback_browser.picker.value" = "Currently set to %@";
"accessibility.settings.refresh_browsers.label" = "Refresh browsers button";
"accessibility.settings.refresh_browsers.hint" = "Tap to refresh the list of available browsers";
"accessibility.settings.notify_fallback.label" = "Notify on fallback toggle";
"accessibility.settings.notify_fallback.hint" = "When enabled, you will receive a notification when a URL is opened with the fallback browser";
"accessibility.settings.notify_fallback.value.enabled" = "Fallback notifications are enabled";
"accessibility.settings.notify_fallback.value.disabled" = "Fallback notifications are disabled";

// Settings - Logging Section
"accessibility.settings.logging.section_label" = "Logging Settings Section";
"accessibility.settings.logging.enable.label" = "Enable logging toggle";
"accessibility.settings.logging.enable.hint" = "When enabled, Proxly will log opened URLs and diagnostic messages for troubleshooting";
"accessibility.settings.logging.enable.value.enabled" = "Logging is enabled";
"accessibility.settings.logging.enable.value.disabled" = "Logging is disabled";

"accessibility.settings.show_tooltips.label" = "Show tooltips toggle";
"accessibility.settings.show_tooltips.hint" = "When enabled, helpful hints will be shown when hovering over interface elements";
"accessibility.settings.show_tooltips.value.enabled" = "Tooltips are enabled";
"accessibility.settings.show_tooltips.value.disabled" = "Tooltips are disabled";

// MARK: - Onboarding
"onboarding.container.label" = "Onboarding";
"onboarding.container.hint" = "Welcome to Proxly onboarding. Learn about the app features and get started.";

// Onboarding Pages
"onboarding.page.welcome.label" = "Welcome page";
"onboarding.page.welcome.hint" = "Introduction to Proxly application";
"onboarding.page.what_is.label" = "What is Proxly page";
"onboarding.page.what_is.hint" = "Learn what Proxly does and how it works";
"onboarding.page.rules.label" = "Rules page";
"onboarding.page.rules.hint" = "Understand how rules work in Proxly";
"onboarding.page.menu_bar.label" = "Menu bar page";
"onboarding.page.menu_bar.hint" = "Learn about menu bar integration";
"onboarding.page.focus_modes.label" = "Focus modes page";
"onboarding.page.focus_modes.hint" = "Discover Focus Mode integration";
"onboarding.page.get_started.label" = "Get started page";
"onboarding.page.get_started.hint" = "Complete setup and start using Proxly";

// Onboarding Controls
"onboarding.button.previous" = "Previous";
"onboarding.button.previous.label" = "Previous page";
"onboarding.button.previous.hint" = "Go to the previous onboarding page";
"onboarding.button.next" = "Next";
"onboarding.button.next.label" = "Next page";
"onboarding.button.next.hint" = "Go to the next onboarding page";
"onboarding.button.get_started" = "Get Started";
"onboarding.button.get_started.label" = "Get started";
"onboarding.button.get_started.hint" = "Complete onboarding and start using Proxly";

"onboarding.page_indicator.label" = "Page indicator";
"onboarding.page_indicator.value" = "Page %d of %d";
"onboarding.page_indicator.hint" = "Current page position in onboarding";
"onboarding.page_indicators.label" = "Page indicators";
"onboarding.page_indicators.value" = "Page %d of %d";

// Symbol Accessibility
"onboarding.symbol.light.label" = "Proxly app symbol in light mode";
"onboarding.symbol.light.hint" = "Decorative app symbol displayed in light appearance";
"onboarding.symbol.dark.label" = "Proxly app symbol in dark mode";
"onboarding.symbol.dark.hint" = "Decorative app symbol displayed in dark appearance";

// Welcome Page
"onboarding.welcome.title" = "Welcome to Proxly!";
"onboarding.welcome.subtitle" = "Take control of your web browsing experience";
"onboarding.welcome.description" = "Proxly helps you manage how links open, effortlessly routing them to the right browser based on your custom rules.";
"onboarding.welcome.app_icon.label" = "Proxly application icon";
"onboarding.welcome.app_icon.hint" = "The official Proxly app icon";

// What is Proxly Page
"onboarding.what_is.title" = "What Can Proxly Do For You?";
"onboarding.what_is.subtitle" = "Intelligent browser routing made simple";
"onboarding.what_is.urls.title" = "URLs";
"onboarding.what_is.browsers.title" = "Browsers";
"onboarding.what_is.explanation" = "Proxly automatically opens links in the right browser or app, or can even block them, all based on your custom rules. No more manually copying and pasting links!";

// What is Proxly Demo Accessibility
"onboarding.what_is.urls.demo.label" = "Example URLs demonstration";
"onboarding.what_is.urls.demo.hint" = "Shows sample website URLs that can be routed by Proxly";
"onboarding.what_is.arrow.label" = "Arrow indicating direction";
"onboarding.what_is.arrow.hint" = "Shows the flow from URLs to browsers";
"onboarding.what_is.browsers.demo.label" = "Example browsers demonstration";
"onboarding.what_is.browsers.demo.hint" = "Shows sample browsers that can be used as routing targets";

// Demo Components Accessibility
"onboarding.url_demo.label" = "Example website URL";
"onboarding.url_demo.hint" = "Demonstrates how different websites can be categorized for routing";
"onboarding.browser_demo.label" = "Example browser option";
"onboarding.browser_demo.hint" = "Demonstrates browser options available for routing";

// Rules Page
"onboarding.rules.title" = "You're in Charge with Rules";
"onboarding.rules.subtitle" = "Rules are the heart of Proxly";
"onboarding.rules.example.work.title" = "Work Domains";
"onboarding.rules.example.work.description" = "Always open work-domain.com links in Chrome";
"onboarding.rules.example.social.title" = "Social Media";
"onboarding.rules.example.social.description" = "Open social media links in your favorite browser";
"onboarding.rules.example.focus.title" = "Focus Mode";
"onboarding.rules.example.focus.description" = "Block distracting-site.com when Work Focus Mode is on";

// Rules Examples Accessibility
"onboarding.rules.example.work.accessibility.label" = "Work domain rule example";
"onboarding.rules.example.work.accessibility.hint" = "Demonstrates how to route work-related websites to specific browsers";
"onboarding.rules.example.social.accessibility.label" = "Social media rule example";
"onboarding.rules.example.social.accessibility.hint" = "Demonstrates how to route social media websites to preferred browsers";
"onboarding.rules.example.focus.accessibility.label" = "Focus mode rule example";
"onboarding.rules.example.focus.accessibility.hint" = "Demonstrates how to block distracting websites during focus time";

// Menu Bar Page
"onboarding.menu_bar.title" = "Quick Access from Your Menu Bar";
"onboarding.menu_bar.subtitle" = "Keep an eye on Proxly and manage it easily";
"onboarding.menu_bar.proxly_icon.label" = "Proxly menu bar icon";
"onboarding.menu_bar.proxly_icon.hint" = "The Proxly icon in your Mac's menu bar";
"onboarding.menu_bar.feature.status.title" = "See if Proxly is active";
"onboarding.menu_bar.feature.status.description" = "Visual indicator shows when rules are enabled";
"onboarding.menu_bar.feature.toggle.title" = "Quickly enable or disable Proxly";
"onboarding.menu_bar.feature.toggle.description" = "Toggle all rules on or off with one click";
"onboarding.menu_bar.feature.settings.title" = "Open Proxly's settings";
"onboarding.menu_bar.feature.settings.description" = "Access rule editor and configuration";

// Menu Bar Accessibility
"onboarding.menu_bar.wifi.label" = "Wi-Fi status icon";
"onboarding.menu_bar.battery.label" = "Battery status icon";
"onboarding.menu_bar.mockup.label" = "Menu bar mockup";
"onboarding.menu_bar.mockup.hint" = "Demonstration of how Proxly appears in your Mac's menu bar";
"onboarding.menu_bar.features.label" = "Menu bar features list";
"onboarding.menu_bar.features.hint" = "Lists the main features available from the menu bar";
"onboarding.menu_bar.feature.label" = "Menu bar feature";
"onboarding.menu_bar.feature.hint" = "Individual feature available from the Proxly menu bar";

// Focus Modes Page
"onboarding.focus_modes.title" = "Smarter Browsing with Focus Modes";
"onboarding.focus_modes.subtitle" = "Sync with your macOS Focus Modes";
"onboarding.focus_modes.work.description" = "Different browsers for work time";
"onboarding.focus_modes.personal.description" = "Personal sites during personal time";
"onboarding.focus_modes.dnd.description" = "Block distracting sites during Do Not Disturb";
"onboarding.focus_modes.permission_note" = "Proxly will ask for permission to access Focus Modes to enable this feature.";

// Focus Modes Examples Accessibility
"onboarding.focus_modes.work.accessibility.label" = "Work focus mode example";
"onboarding.focus_modes.work.accessibility.hint" = "Demonstrates how Proxly can route browsers differently during work focus time";
"onboarding.focus_modes.personal.accessibility.label" = "Personal focus mode example";
"onboarding.focus_modes.personal.accessibility.hint" = "Demonstrates how Proxly can route browsers differently during personal time";
"onboarding.focus_modes.dnd.accessibility.label" = "Do Not Disturb focus mode example";
"onboarding.focus_modes.dnd.accessibility.hint" = "Demonstrates how Proxly can block distracting websites during Do Not Disturb";
"onboarding.focus_modes.permission_note.label" = "Focus modes permission note";
"onboarding.focus_modes.permission_note.hint" = "Information about permission requirements for Focus Mode integration";

// Get Started Page
"onboarding.get_started.title" = "Ready to Create Your First Rule?";
"onboarding.get_started.subtitle" = "The best way to experience Proxly is to set up your first rule";
"onboarding.get_started.step1.title" = "Set as Default Browser";
"onboarding.get_started.step1.description" = "Set Proxly as your default browser in System Settings";
"onboarding.get_started.step2.title" = "Create Your First Rule";
"onboarding.get_started.step2.description" = "Add a rule to route specific domains to your preferred browser";
"onboarding.get_started.step3.title" = "Test and Enjoy";
"onboarding.get_started.step3.description" = "Click any link and watch Proxly intelligently route it";
"onboarding.get_started.ready_message" = "You're All Set!";
"onboarding.get_started.help_message" = "Explore Proxly's settings to customize it further. You can always add, change, or remove rules as your needs evolve.";

// Get Started Accessibility
"onboarding.get_started.completion.label" = "Setup completion message";
"onboarding.get_started.completion.hint" = "Congratulations message indicating that Proxly setup is complete";
"onboarding.setup_step.button.label" = "Setup step with action";
"onboarding.setup_step.button.hint" = "Interactive setup step that can be clicked to perform an action";
"onboarding.setup_step.info.label" = "Setup step information";
"onboarding.setup_step.info.hint" = "Informational setup step providing instructions for completing setup";
// MARK: - Rule Management
"rule.remove" = "Remove Rule";
"rule.drop_browser" = "Drop URL (Block)";
"rule.drop_browser.description" = "Block this URL and prevent it from opening";
"rule.enable.title" = "Enable Rule";
"rule.enable.subtitle" = "When enabled, this rule will be active and used for URL routing";

// MARK: - Missing Strings
"Navigation Tab Bar" = "Navigation Tab Bar";
"Unknown Browser" = "Unknown Browser";
"%@ %lld" = "%@ %lld";
"" = "";

// MARK: - About Accessibility
"accessibility.about.toolbar.title.label" = "About Proxly";
"accessibility.about.toolbar.title.hint" = "Information about Proxly app, features, and developer";

"accessibility.about.navigation.scroll_view.label" = "About information";
"accessibility.about.navigation.scroll_view.hint" = "Scroll to view app information, features, and links";

"accessibility.about.app_info.section_label" = "App Information";
"accessibility.about.app_info.app_icon.label" = "Proxly app icon";
"accessibility.about.app_info.app_icon.hint" = "Official icon of the Proxly application";
"accessibility.about.app_info.app_name.label" = "Proxly - Intelligent Browser Router";
"accessibility.about.app_info.app_subtitle.label" = "Intelligent browser routing for macOS";
"accessibility.about.app_info.version_badge.label" = "%@ %@";
"accessibility.about.app_info.version_badge.hint" = "App version and build information";

"accessibility.about.description.section_label" = "App Description";
"accessibility.about.description.section_hint" = "Learn what Proxly does and how it helps with browser management";
"accessibility.about.description.main_text.label" = "Main app description";
"accessibility.about.description.detail_text.label" = "Detailed app description";

"accessibility.about.features.section_label" = "App Features";
"accessibility.about.features.section_hint" = "Discover all the powerful features that Proxly offers";
"accessibility.about.features.feature_row.label" = "Feature: %@";
"accessibility.about.features.feature_row.hint" = "Description: %@";
"accessibility.about.features.feature_list.label" = "List of Proxly features";

"accessibility.about.developer.section_label" = "Developer Information";
"accessibility.about.developer.section_hint" = "Learn about the person who created Proxly";
"accessibility.about.developer.photo.label" = "Developer photo";
"accessibility.about.developer.photo.hint" = "Photo of Paweł Mazurkiewicz, the developer of Proxly";
"accessibility.about.developer.name.label" = "Developer name: Paweł Mazurkiewicz";
"accessibility.about.developer.role.label" = "Role: macOS Developer";
"accessibility.about.developer.description.label" = "Bio: Crafting beautiful, functional apps for Mac";

"accessibility.about.links.section_label" = "Links and Support";
"accessibility.about.links.section_hint" = "Access support, request features, and rate the app";
"accessibility.about.links.link_button.label" = "%@ button";
"accessibility.about.links.link_button.hint" = "%@ - tap to open";
"accessibility.about.links.support_button.label" = "Contact Support";
"accessibility.about.links.support_button.hint" = "Send an email to get help with Proxly or report bugs";
"accessibility.about.links.feature_request_button.label" = "Request Feature";
"accessibility.about.links.feature_request_button.hint" = "Send an email to suggest new features for Proxly";
"accessibility.about.links.rate_button.label" = "Rate on App Store";
"accessibility.about.links.rate_button.hint" = "Open the App Store to rate and review Proxly";

// MARK: - Additional Settings Accessibility
"accessibility.settings.enable_rules.label" = "Enable rules toggle";
"accessibility.settings.enable_rules.hint" = "When enabled, all rules will be active. When disabled, all rules will be ignored";
"accessibility.settings.enable_rules.value.enabled" = "Rules are enabled";
"accessibility.settings.enable_rules.value.disabled" = "Rules are disabled";
"accessibility.settings.launch_at_login.label" = "Launch at login toggle";
"accessibility.settings.launch_at_login.hint" = "When enabled, Proxly will automatically start when you log in to your Mac";
"accessibility.settings.launch_at_login.value.enabled" = "Launch at login is enabled";
"accessibility.settings.launch_at_login.value.disabled" = "Launch at login is disabled";

// MARK: - ContentView Accessibility
"accessibility.content_view.container_label" = "Proxly Main Window";
"accessibility.content_view.container_hint" = "The main application window containing navigation tabs for Rules, Settings, and About";

"accessibility.content_view.tab_view.container_label" = "Main Navigation";
"accessibility.content_view.tab_view.container_hint" = "Tab navigation to switch between different sections of Proxly";

"accessibility.content_view.tab.rules.label" = "Rules Tab";
"accessibility.content_view.tab.rules.hint" = "Tap to view and manage browser routing rules";
"accessibility.content_view.tab.rules.selected" = "Rules tab selected";
"accessibility.content_view.tab.rules.unselected" = "Rules tab not selected";

"accessibility.content_view.tab.settings.label" = "Settings Tab";
"accessibility.content_view.tab.settings.hint" = "Tap to view and modify application settings";
"accessibility.content_view.tab.settings.selected" = "Settings tab selected";
"accessibility.content_view.tab.settings.unselected" = "Settings tab not selected";

"accessibility.content_view.tab.about.label" = "About Tab";
"accessibility.content_view.tab.about.hint" = "Tap to view information about Proxly and developer details";
"accessibility.content_view.tab.about.selected" = "About tab selected";
"accessibility.content_view.tab.about.unselected" = "About tab not selected";

// MARK: - RuleList Accessibility
"accessibility.rule_list.navigation.container_label" = "Rules Navigation";
"accessibility.rule_list.navigation.container_hint" = "Split view navigation containing rule list and editing interface";
"accessibility.rule_list.navigation.sidebar_label" = "Rules Sidebar";
"accessibility.rule_list.navigation.sidebar_hint" = "List of all your browser routing rules";

"accessibility.rule_list.toolbar.title_label" = "Rules Screen Title";
"accessibility.rule_list.toolbar.title_hint" = "Main title for the rules management screen";

"accessibility.rule_list.button.add_rule_label" = "Add Rule";
"accessibility.rule_list.button.add_rule_hint" = "Tap to create a new browser routing rule";

"accessibility.rule_list.toggle.rules_enabled_label" = "Rules Enabled Toggle";
"accessibility.rule_list.toggle.rules_enabled_hint" = "Toggle to enable or disable all rules. When disabled, all rules will be ignored";
"accessibility.rule_list.toggle.rules_enabled_value_on" = "Rules are enabled";
"accessibility.rule_list.toggle.rules_enabled_value_off" = "Rules are disabled";

"accessibility.rule_list.empty_state.container_label" = "No Rules Message";
"accessibility.rule_list.empty_state.container_hint" = "Information display when no rules have been created yet";
"accessibility.rule_list.empty_state.description_label" = "No Rules Description";
"accessibility.rule_list.empty_state.description_hint" = "Explanation of what rules do and why they're useful";
"accessibility.rule_list.empty_state.create_button_label" = "Create First Rule";
"accessibility.rule_list.empty_state.create_button_hint" = "Tap to create your first browser routing rule";

"accessibility.rule_list.list.scroll_view_label" = "Rules List";
"accessibility.rule_list.list.scroll_view_hint" = "Scrollable list containing %d rules";

"accessibility.rule_list.rule_card.button_label" = "Rule %@";
"accessibility.rule_list.rule_card.button_hint" = "Tap to view and edit this rule";
"accessibility.rule_list.rule_card.selected_value" = "Selected";
"accessibility.rule_list.rule_card.unselected_value" = "Not selected";

"accessibility.rule_list.rule_card.type_label" = "Rule type: %@";
"accessibility.rule_list.rule_card.type_hint" = "The type of condition this rule matches";

"accessibility.rule_list.rule_card.name_label" = "Rule name: %@";

"accessibility.rule_list.rule_card.condition_label" = "Condition: %@";

"accessibility.rule_list.rule_card.browser_label" = "Target browser: %@";
"accessibility.rule_list.rule_card.browser_hint" = "The browser that will open links matching this rule";

"accessibility.rule_list.rule_card.priority_label" = "Priority: %d";
"accessibility.rule_list.rule_card.priority_hint" = "Rule priority level - higher numbers take precedence";

"accessibility.rule_list.detail.edit_view_label" = "Edit Rule %@";
"accessibility.rule_list.detail.edit_view_hint" = "Rule editing interface for modifying rule settings";
"accessibility.rule_list.detail.placeholder_label" = "Select a Rule";
"accessibility.rule_list.detail.placeholder_hint" = "Choose a rule from the list to view and edit its details";

// MARK: - MenuBarManager Accessibility
"accessibility.menu_bar_manager.status_item.button_label" = "Proxly Menu Bar";
"accessibility.menu_bar_manager.status_item.button_hint_enabled" = "Proxly is active and rules are enabled. Left-click to open settings, right-click for quick actions";
"accessibility.menu_bar_manager.status_item.button_hint_disabled" = "Proxly is running but rules are disabled. Left-click to open settings, right-click for quick actions";
"accessibility.menu_bar_manager.status_item.role_description" = "Menu Bar Application";
"accessibility.menu_bar_manager.status_item.value_enabled" = "Rules enabled";
"accessibility.menu_bar_manager.status_item.value_disabled" = "Rules disabled";

"accessibility.menu_bar_manager.menu.container_label" = "Proxly Menu";
"accessibility.menu_bar_manager.menu.container_hint" = "Quick access menu for Proxly settings and actions";

"accessibility.menu_bar_manager.menu.toggle_rules.label" = "Toggle Rules";
"accessibility.menu_bar_manager.menu.toggle_rules.hint" = "Enable or disable all browser routing rules";

"accessibility.menu_bar_manager.menu.open_settings.label" = "Open Settings";
"accessibility.menu_bar_manager.menu.open_settings.hint" = "Open the main Proxly settings window";

"accessibility.menu_bar_manager.menu.quit.label" = "Quit Proxly";
"accessibility.menu_bar_manager.menu.quit.hint" = "Exit the Proxly application";

"accessibility.menu_bar_manager.actions.left_click" = "Open Settings";
"accessibility.menu_bar_manager.actions.right_click" = "Show Menu";
"accessibility.menu_bar_manager.actions.open_settings" = "Open Settings Window";
"accessibility.menu_bar_manager.actions.toggle_rules" = "Toggle Rule Activation";
"accessibility.menu_bar_manager.actions.quit" = "Quit Application";

// MARK: - Selection Panel Accessibility
"accessibility.selection_panel.container.label" = "Browser selection panel";
"accessibility.selection_panel.container.hint" = "Choose which browser to open the link with. Use arrow keys to navigate, Enter to select, or Escape to cancel";
"accessibility.selection_panel.container.role_description" = "Modal dialog for browser selection";

"accessibility.selection_panel.header.section_label" = "Browser selection header";
"accessibility.selection_panel.header.title.label" = "Choose a Browser";
"accessibility.selection_panel.header.title.hint" = "Main title for the browser selection dialog";
"accessibility.selection_panel.header.subtitle.label" = "Select which browser should open this link";
"accessibility.selection_panel.header.subtitle.hint" = "Instructions for using the browser selection dialog";
"accessibility.selection_panel.header.icon.label" = "Browser selection icon";

"accessibility.selection_panel.browser_grid.container_label" = "Available browsers";
"accessibility.selection_panel.browser_grid.container_hint" = "%d browsers available. Use arrow keys to navigate between options";
"accessibility.selection_panel.browser_grid.section_label" = "Browser options grid";

"accessibility.selection_panel.browser_card.button_label" = "Select %@ browser";
"accessibility.selection_panel.browser_card.button_label_with_shortcut" = "Select %@ browser, shortcut %d";
"accessibility.selection_panel.browser_card.button_hint" = "Tap or press Enter to open the link with this browser";
"accessibility.selection_panel.browser_card.button_hint_with_shortcut" = "Tap, press Enter, or press %d to open the link with this browser";
"accessibility.selection_panel.browser_card.icon_label" = "%@ browser icon";
"accessibility.selection_panel.browser_card.name_label" = "%@ browser name";
"accessibility.selection_panel.browser_card.shortcut_badge_label" = "Shortcut %d";
"accessibility.selection_panel.browser_card.shortcut_badge_hint" = "Press this number key to quickly select this browser";
"accessibility.selection_panel.browser_card.role_description" = "Browser selection button";

"accessibility.selection_panel.url_section.container_label" = "URL information";
"accessibility.selection_panel.url_section.container_hint" = "Shows the web address that will be opened";
"accessibility.selection_panel.url_section.section_label" = "URL section";
"accessibility.selection_panel.url_section.icon_label" = "Link icon";
"accessibility.selection_panel.url_section.title_label" = "Opening:";
"accessibility.selection_panel.url_section.url_label" = "Web address: %@";
"accessibility.selection_panel.url_section.url_hint" = "This is the web address that will be opened in the selected browser";

"accessibility.selection_panel.action_section.container_label" = "Actions and instructions";
"accessibility.selection_panel.action_section.container_hint" = "Contains usage instructions and cancel option";
"accessibility.selection_panel.action_section.section_label" = "Action section";
"accessibility.selection_panel.action_section.instructions_label" = "Press 1-9 or click to select";
"accessibility.selection_panel.action_section.instructions_hint" = "Instructions for selecting a browser using keyboard shortcuts or mouse";
"accessibility.selection_panel.action_section.cancel_button.label" = "Cancel browser selection";
"accessibility.selection_panel.action_section.cancel_button.hint" = "Close the browser selection panel without opening any browser";
"accessibility.selection_panel.action_section.cancel_button.role_description" = "Cancel button";

"accessibility.selection_panel.navigation.focus_moved_to_browser" = "Focus moved to browser option";
"accessibility.selection_panel.navigation.focus_moved_to_cancel" = "Focus moved to cancel button";
"accessibility.selection_panel.navigation.browser_selected" = "Browser selected";
"accessibility.selection_panel.navigation.panel_dismissed" = "Browser selection panel dismissed";

"accessibility.selection_panel.actions.select_browser" = "Select browser";
"accessibility.selection_panel.actions.cancel" = "Cancel selection";
"accessibility.selection_panel.actions.dismiss" = "Dismiss panel";

"accessibility.selection_panel.announcements.panel_opened" = "Browser selection panel opened with %d browsers available for %@";
"accessibility.selection_panel.announcements.browser_focused" = "%@ browser focused";
"accessibility.selection_panel.announcements.browser_focused_with_shortcut" = "%@ browser focused, shortcut %d";
"accessibility.selection_panel.announcements.browser_selected" = "%@ browser selected, opening link";
"accessibility.selection_panel.announcements.panel_cancelled" = "Browser selection cancelled";
"accessibility.selection_panel.announcements.auto_dismiss_warning" = "Browser selection panel will close automatically in 10 seconds";

// MARK: - Menu Bar Manager Accessibility
"accessibility.menu_bar_manager.status_item.button_label" = "Proxly menu";
"accessibility.menu_bar_manager.status_item.button_hint_enabled" = "Rules are enabled. Click to open menu or right-click for quick access";
"accessibility.menu_bar_manager.status_item.button_hint_disabled" = "Rules are disabled. Click to open menu or right-click for quick access";
"accessibility.menu_bar_manager.status_item.role_description" = "Menu bar status item";
"accessibility.menu_bar_manager.status_item.value_enabled" = "Rules enabled";
"accessibility.menu_bar_manager.status_item.value_disabled" = "Rules disabled";

"accessibility.menu_bar_manager.menu.container_label" = "Proxly menu";
"accessibility.menu_bar_manager.menu.container_hint" = "Menu with options to toggle rules, open settings, or quit the application";
"accessibility.menu_bar_manager.menu.toggle_rules.label" = "Toggle rules";
"accessibility.menu_bar_manager.menu.toggle_rules.hint" = "Enable or disable all browser routing rules";
"accessibility.menu_bar_manager.menu.open_settings.label" = "Open settings";
"accessibility.menu_bar_manager.menu.open_settings.hint" = "Open the Proxly settings window";
"accessibility.menu_bar_manager.menu.quit.label" = "Quit Proxly";
"accessibility.menu_bar_manager.menu.quit.hint" = "Exit the Proxly application";

"accessibility.menu_bar_manager.actions.left_click" = "Open menu";
"accessibility.menu_bar_manager.actions.right_click" = "Open context menu";
"accessibility.menu_bar_manager.actions.open_settings" = "Open settings";
"accessibility.menu_bar_manager.actions.toggle_rules" = "Toggle rules";
"accessibility.menu_bar_manager.actions.quit" = "Quit application";

// MARK: - License Sheet
"about.license_sheet.title" = "Open Source Licenses";
"about.license_sheet.description" = "This application uses the following open source software libraries:";
"about.license_sheet.button.done" = "Done";
"about.license_sheet.swiftglass.name" = "SwiftGlass";
"about.license_sheet.swiftglass.version" = "Version: 1.9.9";
"about.license_sheet.swiftglass.source" = "Source: https://github.com/1998code/SwiftGlass/";

// MARK: - About Links
"about.link.licenses" = "Open Source Licenses";
"about.link.licenses_description" = "View open source software licenses";

// MARK: - License Sheet Accessibility
"accessibility.about.license_sheet.title.label" = "Open Source Licenses";
"accessibility.about.license_sheet.title.hint" = "Information about third-party libraries used in Proxly";
"accessibility.about.license_sheet.description.label" = "License information header";
"accessibility.about.license_sheet.description.hint" = "Explains what information is shown in this view";
"accessibility.about.license_sheet.done_button.label" = "Done";
"accessibility.about.license_sheet.done_button.hint" = "Closes the license information sheet";
"accessibility.about.license_sheet.swiftglass.section.label" = "SwiftGlass library license";
"accessibility.about.license_sheet.swiftglass.section.hint" = "License information for the SwiftGlass library";
"accessibility.about.license_sheet.scroll_view.label" = "Open source licenses";
"accessibility.about.license_sheet.scroll_view.hint" = "Scroll to view license information for third-party libraries";

// MARK: - About Links Accessibility
"accessibility.about.links.licenses_button.label" = "Open Source Licenses";
"accessibility.about.links.licenses_button.hint" = "Opens a sheet with open source software license information";

// MARK: - Browser Profile Selector
"browser_profile_selector.profile" = "Profile";
"browser_profile_selector.custom_arguments" = "Custom Arguments";
"browser_profile_selector.no_profile_support" = "No profile support";
"browser_profile_selector.permission_needed" = "Permission needed";
"browser_profile_selector.permission_denied" = "Permission denied";
"browser_profile_selector.permission_expired" = "Permission expired";
"browser_profile_selector.profiles_count" = "%d profiles";
"browser_profile_selector.no_profiles_found" = "No profiles found";
"browser_profile_selector.standard_browser" = "Standard browser";
"browser_profile_selector.tap_to_enable_profiles" = "Tap to enable profiles";
"browser_profile_selector.does_not_support_profiles" = "%@ does not support profiles";

// MARK: - Profile Permission View
"profile_permission.title" = "Browser Profile Support";
"profile_permission.subtitle" = "Launch links directly in specific browser profiles";
"profile_permission.what_enables" = "What this enables:";
"profile_permission.benefit.separate_browsing.title" = "Separate work and personal browsing";
"profile_permission.benefit.separate_browsing.description" = "Keep your work and personal browsing completely separate";
"profile_permission.benefit.different_extensions.title" = "Use different extensions per profile";
"profile_permission.benefit.different_extensions.description" = "Each profile can have its own set of extensions and settings";
"profile_permission.benefit.profile_configs.title" = "Profile-specific configurations";
"profile_permission.benefit.profile_configs.description" = "Different themes, bookmarks, and preferences for each profile";
"profile_permission.permission_required" = "Permission required:";
"profile_permission.requirement.read_access.title" = "Read-only access to browser directories";
"profile_permission.requirement.read_access.description" = "Proxly needs to read configuration files to detect your profiles";
"profile_permission.requirement.no_data_access.title" = "No personal data access";
"profile_permission.requirement.no_data_access.description" = "Only profile names and basic settings are read - no history, passwords, or browsing data";
"profile_permission.requirement.optional.title" = "Completely optional";
"profile_permission.requirement.optional.description" = "You can use Proxly without profile features - they're entirely opt-in";
"profile_permission.browser_permissions" = "Browser permissions:";
"profile_permission.learn_more" = "Learn More About Data Access";
"profile_permission.done" = "Done";
"profile_permission.state.not_requested" = "Permission not requested";
"profile_permission.state.denied" = "Permission denied";
"profile_permission.state.granted" = "Permission granted";
"profile_permission.state.needs_refresh" = "Permission needs refresh";
"profile_permission.button.requesting" = "Requesting...";
"profile_permission.button.grant_access" = "Grant Access";
"profile_permission.button.retry" = "Retry";
"profile_permission.button.revoke" = "Revoke";

// MARK: - Data Access Explanation
"data_access.title" = "Data Access Explanation";
"data_access.what_accesses" = "What Proxly accesses:";
"data_access.access.config_files.title" = "Profile configuration files";
"data_access.access.config_files.description" = "Files like 'Local State' (Chrome/Edge) and 'profiles.ini' (Firefox) that contain profile names and basic settings";
"data_access.access.directory_names.title" = "Profile directory names";
"data_access.access.directory_names.description" = "The names of profile folders to identify available profiles";
"data_access.never_accesses" = "What Proxly NEVER accesses:";
"data_access.never.browsing_history.title" = "Browsing history";
"data_access.never.browsing_history.description" = "Your browsing history is never read or accessed";
"data_access.never.passwords.title" = "Passwords and login data";
"data_access.never.passwords.description" = "No password files or login information is accessed";
"data_access.never.bookmarks.title" = "Bookmarks and personal data";
"data_access.never.bookmarks.description" = "Personal bookmarks and browsing data remain private";
"data_access.never.cookies.title" = "Cookies and session data";
"data_access.never.cookies.description" = "No cookies or session information is read";
"data_access.technical_details" = "Technical details:";
"data_access.technical.security_bookmarks.title" = "Security scoped bookmarks";
"data_access.technical.security_bookmarks.description" = "macOS security scoped bookmarks are used to maintain access only to directories you explicitly approve";
"data_access.technical.read_only.title" = "Read-only access";
"data_access.technical.read_only.description" = "Proxly only requests read access - it cannot modify your browser data";
"data_access.technical.revocable.title" = "Revocable permissions";
"data_access.technical.revocable.description" = "You can revoke access at any time from within Proxly's settings";

// MARK: - Profile Selection View
"profile_selection.enable_support" = "Enable Profile Support";
"profile_selection.grant_permission" = "Grant permission to access %@ profiles";
"profile_selection.grant_permission_button" = "Grant Permission";
"profile_selection.permission_denied_title" = "Permission Denied";
"profile_selection.permission_denied_description" = "Profile support requires permission to access browser directories";
"profile_selection.retry_permission" = "Retry Permission";
"profile_selection.permission_expired_title" = "Permission Expired";
"profile_selection.permission_expired_description" = "Profile permission needs to be refreshed";
"profile_selection.refresh_permission" = "Refresh Permission";
"profile_selection.detecting_profiles" = "Detecting profiles...";
"profile_selection.no_profiles_found" = "No profiles found";
"profile_selection.no_profiles_description" = "No %@ profiles were detected. You can create profiles in %@ and they will appear here.";
"profile_selection.select_profile" = "Select a profile:";
"profile_selection.any_profile" = "Any Profile";
"profile_selection.use_default_profile" = "Use default profile";
"profile_selection.default" = "Default";
"profile_selection.used_time_ago" = "Used %@";
"profile_selection.active" = "Active";
"profile_selection.inactive" = "Inactive";

// MARK: - Custom Arguments View
"custom_arguments.title" = "Custom Arguments";
"custom_arguments.placeholder" = "Add argument (e.g., --incognito)";
"custom_arguments.add" = "Add";
"custom_arguments.warning" = "Custom arguments can affect browser behavior. Use with caution.";
"custom_arguments.help.title" = "Custom Browser Arguments";
"custom_arguments.help.common_arguments" = "Common Arguments";
"custom_arguments.help.incognito.argument" = "--incognito";
"custom_arguments.help.incognito.description" = "Launch in incognito/private browsing mode";
"custom_arguments.help.new_window.argument" = "--new-window";
"custom_arguments.help.new_window.description" = "Open in a new window";
"custom_arguments.help.disable_security.argument" = "--disable-web-security";
"custom_arguments.help.disable_security.description" = "Disable web security (development only)";
"custom_arguments.help.private_window.argument" = "--private-window";
"custom_arguments.help.private_window.description" = "Launch in private browsing mode";
"custom_arguments.help.new_tab.argument" = "--new-tab";
"custom_arguments.help.new_tab.description" = "Open URL in a new tab";
"custom_arguments.help.important_notes" = "Important Notes";
"custom_arguments.help.note.behavior" = "Custom arguments can affect browser behavior and security";
"custom_arguments.help.note.browser_specific" = "Arguments are browser-specific and may not work in all browsers";
"custom_arguments.help.note.trust" = "Only use arguments you understand and trust";
"custom_arguments.help.app_store_limitations" = "App Store Limitations";
"custom_arguments.help.app_store_description" = "Due to App Store sandbox restrictions, some arguments may not work as expected. The browser will fall back to default behavior if arguments are not supported.";
"custom_arguments.help.done" = "Done";
"custom_arguments.help.compatible" = "Compatible: %@";

// MARK: - Settings Profile Features
"settings.profile_features.title" = "Profile Features";
"settings.profile_features.enable.title" = "Enable Profile Features";
"settings.profile_features.enable.subtitle.enabled" = "Profile features are enabled";
"settings.profile_features.enable.subtitle.disabled" = "Profile features are disabled";
"settings.profile_features.manage_permissions.title" = "Manage Profile Permissions";
"settings.profile_features.manage_permissions.subtitle" = "Configure which browsers can access profile data";
"settings.profile_features.manage_permissions.button" = "Manage Permissions";

// MARK: - License Management
"license.status.valid" = "License valid";
"license.status.invalid" = "Invalid: %@";
"license.status.not_verified" = "License not verified";
"license.status.verifying" = "Verifying license...";

"license.error.empty" = "License key cannot be empty";
"license.error.storage" = "Failed to store license key";
"license.error.invalid_key" = "Invalid license key";
"license.error.network" = "Network error during verification";
"license.error.unknown" = "Unknown error occurred";
"license.error.invalid_url" = "Invalid verification URL";
"license.error.invalid_response" = "Invalid server response";
"license.error.http_error" = "HTTP error: %d";
"license.error.invalid_json" = "Invalid response format";

"license.prompt.title" = "Enter License Key";
"license.prompt.subtitle" = "Please enter your Proxly license key to continue";
"license.prompt.placeholder" = "Enter your license key";
"license.prompt.verify_button" = "Verify License";
"license.prompt.quit_button" = "Quit";
"license.prompt.retry_button" = "Retry";

"license.onboarding.title" = "Welcome to Proxly";
"license.onboarding.subtitle" = "License Verification";
"license.onboarding.description" = "To use Proxly, please enter your license key. You can purchase one from our website if you don't have one yet.";

// MARK: - Browser Profile Accessibility
"accessibility.browser_profile_selector.profile.label" = "Profile selection";
"accessibility.browser_profile_selector.profile.hint" = "Choose a browser profile for this rule";
"accessibility.browser_profile_selector.custom_arguments.label" = "Custom arguments";
"accessibility.browser_profile_selector.custom_arguments.hint" = "Add custom command line arguments for the browser";
"accessibility.browser_profile_selector.refresh_profiles.label" = "Refresh profiles";
"accessibility.browser_profile_selector.refresh_profiles.hint" = "Refresh the list of available profiles";

// MARK: - Profile Permission Accessibility
"accessibility.profile_permission.title.label" = "Browser Profile Support";
"accessibility.profile_permission.title.hint" = "Information about browser profile features and permissions";
"accessibility.profile_permission.benefit.label" = "Profile feature benefit";
"accessibility.profile_permission.benefit.hint" = "Explains how profile features can help organize your browsing";
"accessibility.profile_permission.requirement.label" = "Permission requirement";
"accessibility.profile_permission.requirement.hint" = "Information about what permissions are needed and why";
"accessibility.profile_permission.browser_row.label" = "Browser permission for %@";
"accessibility.profile_permission.browser_row.hint" = "Manage profile access permissions for this browser";
"accessibility.profile_permission.learn_more.label" = "Learn more about data access";
"accessibility.profile_permission.learn_more.hint" = "Opens detailed explanation of what data Proxly accesses";

// MARK: - Profile Selection Accessibility
"accessibility.profile_selection.enable_support.label" = "Enable profile support";
"accessibility.profile_selection.enable_support.hint" = "Grant permission to access browser profiles";
"accessibility.profile_selection.permission_request.label" = "Profile permission request";
"accessibility.profile_selection.permission_request.hint" = "Information about profile permissions with action to grant access";
"accessibility.profile_selection.profile_card.label" = "Profile %@";
"accessibility.profile_selection.profile_card.hint" = "Select this profile for the rule";
"accessibility.profile_selection.any_profile.label" = "Any profile option";
"accessibility.profile_selection.any_profile.hint" = "Use the default profile without specifying a particular one";

// MARK: - Custom Arguments Accessibility
"accessibility.custom_arguments.title.label" = "Custom arguments";
"accessibility.custom_arguments.title.hint" = "Add custom command line arguments for the browser";
"accessibility.custom_arguments.help.label" = "Custom arguments help";
"accessibility.custom_arguments.help.hint" = "Opens help information about browser command line arguments";
"accessibility.custom_arguments.argument.label" = "Argument %@";
"accessibility.custom_arguments.argument.hint" = "Tap to remove this argument";
"accessibility.custom_arguments.add_field.label" = "Add new argument";
"accessibility.custom_arguments.add_field.hint" = "Enter a custom browser argument to add";
"accessibility.custom_arguments.add_button.label" = "Add argument";
"accessibility.custom_arguments.add_button.hint" = "Add the entered argument to the list";

// MARK: - Settings Profile Features Accessibility
"accessibility.settings.profile_features.section.label" = "Profile Features Section";
"accessibility.settings.profile_features.section.hint" = "Configuration options for browser profile features";
"accessibility.settings.profile_features.enable.label" = "Enable profile features";
"accessibility.settings.profile_features.enable.hint" = "When enabled, allows launching links in specific browser profiles";
"accessibility.settings.profile_features.enable.value.enabled" = "Profile features are enabled";
"accessibility.settings.profile_features.enable.value.disabled" = "Profile features are disabled";
"accessibility.settings.profile_features.manage_permissions.label" = "Manage profile permissions";
"accessibility.settings.profile_features.manage_permissions.hint" = "Opens profile permission management interface";

/* Missing Menu Bar Manager Accessibility */
"accessibility.menu_bar_manager.status_item.button_label" = "Proxly Menu";
"accessibility.menu_bar_manager.status_item.button_hint_enabled" = "Proxly rules are enabled. Click to open menu.";
"accessibility.menu_bar_manager.actions.open_settings" = "Open Settings";

/* Missing Settings Accessibility */
"accessibility.settings.show_tooltips.label" = "Show Tooltips Toggle";
"accessibility.settings.show_tooltips.hint" = "Toggle to show or hide helpful tooltips throughout the app";
"accessibility.settings.show_tooltips.value.enabled" = "Tooltips are enabled";
"accessibility.settings.show_tooltips.value.disabled" = "Tooltips are disabled";

/* Missing Profile Features Settings */
"settings.section.profile_features" = "Profile Features";
"accessibility.settings.profile_features.section_label" = "Profile Features Section";
"settings.profile_features.enable" = "Enable Profile Features";
"settings.profile_features.subtitle.enabled" = "Profile features are enabled";
"settings.profile_features.subtitle.disabled" = "Profile features are disabled";
"settings.profile_features.manage_permissions" = "Manage Profile Permissions";
"settings.profile_features.manage_permissions.subtitle" = "Configure which browsers can access profile data";
"settings.profile_features.manage_permissions.button" = "Manage Permissions";

// MARK: - License Prompt View
"license.prompt.input.label" = "License Key";
"license.prompt.input.placeholder" = "Enter your license key";
"license.prompt.button.verify" = "Verify License";
"license.prompt.button.purchase" = "Purchase License";
"license.prompt.app_store.notice" = "This is an App Store build. License verification is not required.";

"license.prompt.input.accessibility.label" = "License key input field";
"license.prompt.input.accessibility.hint" = "Enter your Proxly license key here";
"license.prompt.status.accessibility.label" = "License verification status";
"license.prompt.button.verify.accessibility.label" = "Verify license button";
"license.prompt.button.verify.accessibility.hint" = "Tap to verify the entered license key";
"license.prompt.button.purchase.accessibility.label" = "Purchase license button";
"license.prompt.button.purchase.accessibility.hint" = "Tap to open the purchase page for Proxly";
"license.prompt.app_store.accessibility.label" = "App Store build notice";

// MARK: - Onboarding License Page
"onboarding.license.title" = "Welcome to Proxly";
"onboarding.license.subtitle" = "To get started, please verify your license key or purchase Proxly.";
"onboarding.license.input.label" = "License Key";
"onboarding.license.input.placeholder" = "Enter your license key";
"onboarding.license.button.verify" = "Verify License";
"onboarding.license.button.purchase" = "Purchase License";
"onboarding.license.app_store.notice" = "You're using the App Store version. License verification is not required.";
"onboarding.license.help.message" = "Need help? Contact support or check your purchase email for your license key.";

"onboarding.license.input.accessibility.label" = "License key input field";
"onboarding.license.input.accessibility.hint" = "Enter your Proxly license key to continue";
"onboarding.license.status.accessibility.label" = "License verification status";
"onboarding.license.button.verify.accessibility.label" = "Verify license button";
"onboarding.license.button.verify.accessibility.hint" = "Verify the entered license key";
"onboarding.license.button.purchase.accessibility.label" = "Purchase license button";
"onboarding.license.button.purchase.accessibility.hint" = "Open purchase page for Proxly";
"onboarding.license.app_store.accessibility.label" = "App Store version notice";
"onboarding.license.help.accessibility.label" = "License help information";

"onboarding.page.license.label" = "License verification page";
"onboarding.page.license.hint" = "Enter and verify your Proxly license key";

"Licensed copy" = "Licensed copy";
